exp_3_node/logs/mplb_9_app1_75rps_wrk.log
Running 30s test @ http://10.106.139.161/?loopCount=25&base=6&exp=6
  5 threads and 5 connections

  Thread calibration: mean lat.: 860.441ms, rate sampling interval: 2758ms
  Thread calibration: mean lat.: 1192.564ms, rate sampling interval: 3778ms
  Thread calibration: mean lat.: 639.112ms, rate sampling interval: 2252ms
  Thread calibration: mean lat.: 1047.214ms, rate sampling interval: 2996ms
  Thread calibration: mean lat.: 1178.538ms, rate sampling interval: 3737ms

-----------------------------------------------------------------------
Test Results @ http://10.106.139.161/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.12s   952.16ms   4.98s    60.19%
    Req/Sec    12.29      1.02    14.00     96.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.12s 
 75.000%    3.84s 
 90.000%    4.49s 
 99.000%    4.98s 
 99.900%    5.15s 
 99.990%    5.15s 
 99.999%    5.15s 
100.000%    5.15s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1232.895     0.000000            1         1.00
    1875.967     0.100000          129         1.11
    2144.255     0.200000          257         1.25
    2478.079     0.300000          386         1.43
    2772.991     0.400000          513         1.67
    3115.007     0.500000          642         2.00
    3258.367     0.550000          707         2.22
    3448.831     0.600000          770         2.50
    3577.855     0.650000          834         2.86
    3680.255     0.700000          899         3.33
    3842.047     0.750000          962         4.00
    3909.631     0.775000          993         4.44
    4007.935     0.800000         1026         5.00
    4118.527     0.825000         1058         5.71
    4177.919     0.850000         1089         6.67
    4411.391     0.875000         1121         8.00
    4452.351     0.887500         1138         8.89
    4489.215     0.900000         1155        10.00
    4558.847     0.912500         1169        11.43
    4644.863     0.925000         1186        13.33
    4685.823     0.937500         1201        16.00
    4710.399     0.943750         1209        17.78
    4743.167     0.950000         1218        20.00
    4775.935     0.956250         1226        22.86
    4800.511     0.962500         1234        26.67
    4812.799     0.968750         1241        32.00
    4816.895     0.971875         1245        35.56
    4833.279     0.975000         1250        40.00
    4841.471     0.978125         1253        45.71
    4874.239     0.981250         1257        53.33
    4907.007     0.984375         1261        64.00
    4911.103     0.985938         1263        71.11
    4923.391     0.987500         1265        80.00
    4968.447     0.989062         1267        91.43
    4980.735     0.990625         1270       106.67
    4997.119     0.992188         1271       128.00
    5001.215     0.992969         1272       142.22
    5005.311     0.993750         1273       160.00
    5009.407     0.994531         1274       182.86
    5025.791     0.995313         1275       213.33
    5038.079     0.996094         1276       256.00
    5042.175     0.996484         1277       284.44
    5042.175     0.996875         1277       320.00
    5046.271     0.997266         1278       365.71
    5046.271     0.997656         1278       426.67
    5062.655     0.998047         1279       512.00
    5062.655     0.998242         1279       568.89
    5062.655     0.998437         1279       640.00
    5148.671     0.998633         1281       731.43
    5148.671     1.000000         1281          inf
#[Mean    =     3123.064, StdDeviation   =      952.161]
#[Max     =     5144.576, Total count    =         1281]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1904 requests in 30.00s, 580.36KB read
Requests/sec:     63.46  
Transfer/sec:     19.34KB